import  * as Yup from 'yup';

export const validationSchema = Yup.object().shape({
  name: Yup.string()
    .min(2, 'Ім\'я повинно містити принаймні 2 символи')
    .max(50, 'Ім\'я не може бути довшим за 50 символів')
    .required('Ім\'я є обов\'язковим полем'),
  email: Yup.string()
    .email('Невірний формат електронної пошти')
    .required('Електронна пошта є обов\'язковим полем'),
  password: Yup.string()
    .min(8, 'Пароль повинен містити принаймні 8 символів')
    .matches(
      /^(?=.*[a-zа-я])(?=.*[A-ZА-Я])(?=.*\d)/,
      'Пароль повинен містити принаймні одну велику літеру (латинську або кирилицю), одну малу літеру (латинську або кирилицю) та одну цифру'
    )
    .required('Пароль є обов\'язковим полем'),
  city: Yup.string()
    .min(2, 'Назва міста повинна містити принаймні 2 символи')
    .required('Місто є обов\'язковим полем'),
  birthDate: Yup.date()
    .max(new Date(), 'Дата народження не може бути в майбутньому')
    .required('Дата народження є обов\'язковим полем'),
  phone: Yup.string()
    .matches(
      /^(\+380|0)\d{9}$/,
      'Невірний формат номера телефону'
    )
    .required('Номер телефону є обов\'язковим полем'),
});
